wiki/python进阶笔记.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://pengpengxp.github.io/css/wiki.css" />
#+options: tangle:nil

#+TITLE: python进阶笔记

* Collections
** TODO defaultdict [[defaultdict_no1][这儿没懂]]
   它可以在初始化时设置数据的类型，感觉有点像 =C++= 中的 =<list>= 这些
   容器一样。
  #+BEGIN_SRC python :results output
    from collections import defaultdict

    colours = (
        ('Yasoob', 'Yellow'),
        ('Ali', 'Blue'),
        ('Arham', 'Green'),
        ('Ali', 'Black'),
        ('Yasoob', 'Red'),
        ('Ahmed', 'Silver'),
    )

    favourite_colours = defaultdict(list)

    for name, colour in colours:
        favourite_colours[name].append(colour)

    print(favourite_colours)
  #+END_SRC

  #+RESULTS:
  : defaultdict(<type 'list'>, {'Arham': ['Green'], 'Yasoob': ['Yellow', 'Red'], 'Ahmed': ['Silver'], 'Ali': ['Blue', 'Black']})

  上面的例子用dict应该这样写：
  #+BEGIN_SRC python :results output
    from collections import defaultdict

    colours = (
        ('Yasoob', 'Yellow'),
        ('Ali', 'Blue'),
        ('Arham', 'Green'),
        ('Ali', 'Black'),
        ('Yasoob', 'Red'),
        ('Ahmed', 'Silver'),
    )

    favourite_colours = dict()

    favourite_colours['xie'] = []
    favourite_colours['xie'].append('peng')

    for name, colour in colours:
        favourite_colours[name] = []
        favourite_colours[name].append(colour)

    print(favourite_colours)
  #+END_SRC

  #+RESULTS:
  : {'Arham': ['Green'], 'Yasoob': ['Red'], 'Ahmed': ['Silver'], 'xie': ['peng'], 'Ali': ['Black']}

  另外，对一个键进行嵌套赋值时，dict会出异常：
  #+BEGIN_SRC python :results output
    d = dict()
    d['xie']['peng'] = 'hi'
  #+END_SRC

  #+RESULTS:

  使用defaultdict可以解决。这个代码硬是没看懂。 <<defaultdict_no1>>
  #+BEGIN_SRC python :results output :exports both
    import collections
    tree = lambda: collections.defaultdict(tree)
    some_dict = tree()
    some_dict['colours']['favourite'] = "yellow"
    print some_dict
  #+END_SRC

  #+RESULTS:
  : defaultdict(<function <lambda> at 0x10187cb18>, {'colours': defaultdict(<function <lambda> at 0x10187cb18>, {'favourite': 'yellow'})})

** counter
   我看reference，它是dict的一个子类。键对应的就是需要统计的元素，值就
   是它的个数。迭代器中的元素可以使用counter来统计个数，counter还可以
   用其它的 =mapping= 或者 =counter= 来初始化。
   #+BEGIN_SRC python :results output :exports both
     from collections import Counter

     colours = (
         ('Yasoob', 'Yellow'),
         ('Ali', 'Blue'),
         ('Arham', 'Green'),
         ('Ali', 'Black'),
         ('Yasoob', 'Red'),
         ('Ahmed', 'Silver'),
     )

     favs = Counter(name for name, colour in colours)
     print(favs)
   #+END_SRC

   #+RESULTS:
   : Counter({'Yasoob': 2, 'Ali': 2, 'Arham': 1, 'Ahmed': 1})

   统计一个文件中的行：
   #+BEGIN_SRC python :results output :exports both
     from collections import Counter
     with open('/tmp/kk.txt', 'rb') as f:
         line_count = Counter(f)
     print(line_count)
   #+END_SRC

   #+RESULTS:
   : Counter({'peng xie\n': 2, 'xie peng\n': 2, '\n': 1, 'peng\n': 1, 'xie peng \n': 1, 'xie\n': 1})

   统计一个字符串：
   #+BEGIN_SRC python :results output :exports both
     from collections import Counter

     c = Counter('xxxxxxie')
     print c
   #+END_SRC

** deque
   双端队列
   #+BEGIN_SRC python :results output :exports both
     from collections import deque

     d = deque()
     d.append(1)
     d.append(2)
     d.append(3)
     print d

     d = deque(range(5))
     print(len(d))
     print(d)

     print d.popleft()
     print d.pop()
     print d
   #+END_SRC

   #+RESULTS:
   : deque([1, 2, 3])
   : 5
   : deque([0, 1, 2, 3, 4])
   : 0
   : 4
   : deque([1, 2, 3])

   它可以限制队列的大小，超出限制大小时，队列的另一端的数据会被挤出去，
   另外，还可以使用extend来用列表扩展队列：
   #+BEGIN_SRC python :results output :exports both
     from collections import deque

     d = deque(maxlen=10)
     for i in range(10):
         d.append(i)

     print d

     d.append(11)
     print d
     d.appendleft(12)
     print d

     d.extend([8, 8, 8])
     print d
   #+END_SRC

   #+RESULTS:
   : deque([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], maxlen=10)
   : deque([1, 2, 3, 4, 5, 6, 7, 8, 9, 11], maxlen=10)
   : deque([12, 1, 2, 3, 4, 5, 6, 7, 8, 9], maxlen=10)
   : deque([3, 4, 5, 6, 7, 8, 9, 8, 8, 8], maxlen=10)

