archive/before-2018-11-10/2017-07-05-python进阶笔记.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>python进阶笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">python进阶笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2fe6989">1. Collections</a>
<ul>
<li><a href="#org57dbec8">1.1. <span class="todo TODO">TODO</span> defaultdict 这儿没懂</a></li>
<li><a href="#org9bbfe90">1.2. counter</a></li>
<li><a href="#orgbabdc61">1.3. deque</a></li>
<li><a href="#org594bf4f">1.4. namedtuple</a></li>
<li><a href="#org610968d">1.5. enum.Enum</a></li>
</ul>
</li>
<li><a href="#org9807038">2. lambda</a></li>
<li><a href="#tuidaoshi">3. 推导式</a></li>
<li><a href="#org3920d8e">4. 上下文管理</a></li>
<li><a href="#org5155ad4">5. 装钸器</a></li>
<li><a href="#org4d74ffe">6. 函数式编程</a>
<ul>
<li><a href="#org0852b6a">6.1. Map</a></li>
<li><a href="#org5050cea">6.2. Filter</a></li>
<li><a href="#orga9655c6">6.3. Reduce</a></li>
</ul>
</li>
<li><a href="#org9da6a5b">7. set 数据结构</a></li>
<li><a href="#orgb8ef82e">8. 三元运算符</a></li>
<li><a href="#orgadec6a5">9. Global</a></li>
<li><a href="#mutable_or_unmutable">10. 可变对象和不可变对象</a>
<ul>
<li><a href="#org467a740">10.1. 总结可变类型和不可变类型</a></li>
</ul>
</li>
<li><a href="#org830a0ec">11. python实用命令</a>
<ul>
<li><a href="#orgce7ad6d">11.1. 共享文件目录</a></li>
<li><a href="#org3428189">11.2. 脚本性能分析</a></li>
<li><a href="#org6195267">11.3. CSV转换为json</a></li>
<li><a href="#org4d59bfa">11.4. 列表辗平</a></li>
<li><a href="#org29e1df6">11.5. 一行式的构造器</a></li>
<li><a href="#org30ffa2c">11.6. 命令行下编译py文件</a></li>
</ul>
</li>
<li><a href="#orgaf685ea">12. 对象自省</a>
<ul>
<li><a href="#org0a344a3">12.1. dir</a></li>
<li><a href="#orge8a7d0e">12.2. type和id</a></li>
<li><a href="#orgee5d645">12.3. inspect</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2fe6989" class="outline-2">
<h2 id="org2fe6989"><span class="section-number-2">1</span> Collections</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org57dbec8" class="outline-3">
<h3 id="org57dbec8"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> defaultdict <a href="#org578e417">这儿没懂</a></h3>
<div class="outline-text-3" id="text-1-1">
<p>
它可以在初始化时设置数据的类型，感觉有点像 <code>C++</code> 中的 <code>&lt;list&gt;</code> 这些
容器一样。
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> defaultdict

    <span style="color: #ff8700;">colours</span> = (
        (<span style="color: #ff4ea3;">'Yasoob'</span>, <span style="color: #ff4ea3;">'Yellow'</span>),
        (<span style="color: #ff4ea3;">'Ali'</span>, <span style="color: #ff4ea3;">'Blue'</span>),
        (<span style="color: #ff4ea3;">'Arham'</span>, <span style="color: #ff4ea3;">'Green'</span>),
        (<span style="color: #ff4ea3;">'Ali'</span>, <span style="color: #ff4ea3;">'Black'</span>),
        (<span style="color: #ff4ea3;">'Yasoob'</span>, <span style="color: #ff4ea3;">'Red'</span>),
        (<span style="color: #ff4ea3;">'Ahmed'</span>, <span style="color: #ff4ea3;">'Silver'</span>),
    )

    <span style="color: #ff8700;">favourite_colours</span> = defaultdict(<span style="color: #d18aff;">list</span>)

    <span style="color: #a1db00;">for</span> name, colour <span style="color: #a1db00;">in</span> colours:
        favourite_colours[name].append(colour)

    <span style="color: #a1db00;">print</span>(favourite_colours)
</pre>
</div>

<p>
上面的例子用dict应该这样写：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> defaultdict

    <span style="color: #ff8700;">colours</span> = (
        (<span style="color: #ff4ea3;">'Yasoob'</span>, <span style="color: #ff4ea3;">'Yellow'</span>),
        (<span style="color: #ff4ea3;">'Ali'</span>, <span style="color: #ff4ea3;">'Blue'</span>),
        (<span style="color: #ff4ea3;">'Arham'</span>, <span style="color: #ff4ea3;">'Green'</span>),
        (<span style="color: #ff4ea3;">'Ali'</span>, <span style="color: #ff4ea3;">'Black'</span>),
        (<span style="color: #ff4ea3;">'Yasoob'</span>, <span style="color: #ff4ea3;">'Red'</span>),
        (<span style="color: #ff4ea3;">'Ahmed'</span>, <span style="color: #ff4ea3;">'Silver'</span>),
    )

    <span style="color: #ff8700;">favourite_colours</span> = <span style="color: #d18aff;">dict</span>()

    <span style="color: #ff8700;">favourite_colours</span>[<span style="color: #ff4ea3;">'xie'</span>] = []
    favourite_colours[<span style="color: #ff4ea3;">'xie'</span>].append(<span style="color: #ff4ea3;">'peng'</span>)

    <span style="color: #a1db00;">for</span> name, colour <span style="color: #a1db00;">in</span> colours:
        <span style="color: #ff8700;">favourite_colours</span>[name] = []
        favourite_colours[name].append(colour)

    <span style="color: #a1db00;">print</span>(favourite_colours)
</pre>
</div>

<p>
另外，对一个键进行嵌套赋值时，dict会出异常：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">d</span> = <span style="color: #d18aff;">dict</span>()
    d[<span style="color: #ff4ea3;">'xie'</span>][<span style="color: #ff4ea3;">'peng'</span>] = <span style="color: #ff4ea3;">'hi'</span>
</pre>
</div>

<p>
使用defaultdict可以解决。这个代码硬是没看懂。 <a id="org578e417"></a>
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">import</span> collections
    <span style="color: #ff8700;">tree</span> = <span style="color: #a1db00;">lambda</span>: collections.defaultdict(tree)
    <span style="color: #ff8700;">some_dict</span> = tree()
    some_dict[<span style="color: #ff4ea3;">'colours'</span>][<span style="color: #ff4ea3;">'favourite'</span>] = <span style="color: #ff4ea3;">"yellow"</span>
    <span style="color: #a1db00;">print</span> some_dict
</pre>
</div>
</div>
</div>

<div id="outline-container-org9bbfe90" class="outline-3">
<h3 id="org9bbfe90"><span class="section-number-3">1.2</span> counter</h3>
<div class="outline-text-3" id="text-1-2">
<p>
我看reference，它是dict的一个子类。键对应的就是需要统计的元素，值就
是它的个数。迭代器中的元素可以使用counter来统计个数，counter还可以
用其它的 <code>mapping</code> 或者 <code>counter</code> 来初始化。
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> Counter

     <span style="color: #ff8700;">colours</span> = (
         (<span style="color: #ff4ea3;">'Yasoob'</span>, <span style="color: #ff4ea3;">'Yellow'</span>),
         (<span style="color: #ff4ea3;">'Ali'</span>, <span style="color: #ff4ea3;">'Blue'</span>),
         (<span style="color: #ff4ea3;">'Arham'</span>, <span style="color: #ff4ea3;">'Green'</span>),
         (<span style="color: #ff4ea3;">'Ali'</span>, <span style="color: #ff4ea3;">'Black'</span>),
         (<span style="color: #ff4ea3;">'Yasoob'</span>, <span style="color: #ff4ea3;">'Red'</span>),
         (<span style="color: #ff4ea3;">'Ahmed'</span>, <span style="color: #ff4ea3;">'Silver'</span>),
     )

     <span style="color: #ff8700;">favs</span> = Counter(name <span style="color: #a1db00;">for</span> name, colour <span style="color: #a1db00;">in</span> colours)
     <span style="color: #a1db00;">print</span>(favs)
</pre>
</div>

<p>
统计一个文件中的行：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> Counter
     <span style="color: #a1db00;">with</span> <span style="color: #d18aff;">open</span>(<span style="color: #ff4ea3;">'/tmp/kk.txt'</span>, <span style="color: #ff4ea3;">'rb'</span>) <span style="color: #a1db00;">as</span> f:
         <span style="color: #ff8700;">line_count</span> = Counter(f)
     <span style="color: #a1db00;">print</span>(line_count)
</pre>
</div>

<p>
统计一个字符串：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> Counter

     <span style="color: #ff8700;">c</span> = Counter(<span style="color: #ff4ea3;">'xxxxxxie'</span>)
     <span style="color: #a1db00;">print</span> c
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbabdc61" class="outline-3">
<h3 id="orgbabdc61"><span class="section-number-3">1.3</span> deque</h3>
<div class="outline-text-3" id="text-1-3">
<p>
双端队列
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> deque

     <span style="color: #ff8700;">d</span> = deque()
     d.append(1)
     d.append(2)
     d.append(3)
     <span style="color: #a1db00;">print</span> d

     <span style="color: #ff8700;">d</span> = deque(<span style="color: #d18aff;">range</span>(5))
     <span style="color: #a1db00;">print</span>(<span style="color: #d18aff;">len</span>(d))
     <span style="color: #a1db00;">print</span>(d)

     <span style="color: #a1db00;">print</span> d.popleft()
     <span style="color: #a1db00;">print</span> d.pop()
     <span style="color: #a1db00;">print</span> d
</pre>
</div>

<p>
它可以限制队列的大小，超出限制大小时，队列的另一端的数据会被挤出去，
另外，还可以使用extend来用列表扩展队列：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> deque

     <span style="color: #ff8700;">d</span> = deque(maxlen=10)
     <span style="color: #a1db00;">for</span> i <span style="color: #a1db00;">in</span> <span style="color: #d18aff;">range</span>(10):
         d.append(i)

     <span style="color: #a1db00;">print</span> d

     d.append(11)
     <span style="color: #a1db00;">print</span> d
     d.appendleft(12)
     <span style="color: #a1db00;">print</span> d

     d.extend([8, 8, 8])
     <span style="color: #a1db00;">print</span> d
</pre>
</div>
</div>
</div>
