wiki/python进阶笔记.org
** namedtuple
   命名元组和元组一样，都是不可变的。但是你可以不用索引来访问其中的元
   素，可以像字典一样去访问它。
   #+BEGIN_SRC python :results output :exports both
     from collections import namedtuple

     Animal = namedtuple('Animal', 'name age type')
     perry = Animal(name="perry", age=31, type="cat")

     print(perry)
     print perry.name
     print perry.age

     d = {'xie': 'peng'}
     print d['xie']
     print d.get('xie')
   #+END_SRC

   #+RESULTS:
   : Animal(name='perry', age=31, type='cat')
   : perry
   : 31
   : peng
   : peng

   元组的属性值是不可变的，下面的代码会出问题：
   #+BEGIN_SRC python :results output
     from collections import namedtuple

     test = namedtuple('test', 'name age')
     d = test(name='xiepeng', age=27)
     d.age = 1
   #+END_SRC

   命名元组很轻量，和元组占用差不多的内存。它比字典更快。

   它也可以通过索引来访问元素，所以它其实是向后兼容元组的。
   #+BEGIN_SRC python :results output :exports both
     from collections import namedtuple

     Animal = namedtuple('Animal', 'name age type')
     perry = Animal(name="perry", age=31, type="cat")
     print(perry[0])
     print(perry[1])
   #+END_SRC

   #+RESULTS:
   : perry
   : 31

   命名元组还可以转换为字典：
   #+BEGIN_SRC python :results output :exports both
     from collections import namedtuple


     test = namedtuple('test', 'name age')

     a = test(name='xie', age=27)
     print type(a)
     print a
     d = a._asdict()
     print type(d)
     print d

   #+END_SRC

   #+RESULTS:
   : <class '__main__.test'>
   : test(name='xie', age=27)
   : <class 'collections.OrderedDict'>
   : OrderedDict([('name', 'xie'), ('age', 27)])

** enum.Enum
   #+BEGIN_SRC python :results output :exports both
     # -*- coding: utf-8; -*-
     from collections import namedtuple
     from enum import Enum

     class Species(Enum):
         cat = 1
         dog = 2
         horse = 3
         aardvark = 4
         butterfly = 5
         owl = 6
         platypus = 7
         dragon = 8
         unicorn = 9
         # 依次类推

         # 但我们并不想关心同一物种的年龄，所以我们可以使用一个别名
         kitten = 1  # (译者注：幼小的猫咪)
         puppy = 2   # (译者注：幼小的狗狗)

     Animal = namedtuple('Animal', 'name age type')
     perry = Animal(name="Perry", age=31, type=Species.cat)
     drogon = Animal(name="Drogon", age=4, type=Species.dragon)
     tom = Animal(name="Tom", age=75, type=Species.cat)
     charlie = Animal(name="Charlie", age=2, type=Species.kitten)

     print charlie.type == tom.type
     print charlie.type

     print Species(1)
     print Species['cat']
     print Species.cat

   #+END_SRC

   #+RESULTS:
   : True
   : Species.kitten
   : Species.kitten
   : Species.kitten
   : Species.kitten
   
* lambda
  和elisp一样，它就是匿名函数。其函数原型如下：
  #+BEGIN_EXAMPLE
    lambda 参数:操作(参数)
  #+END_EXAMPLE

  例子：
  #+BEGIN_SRC python :results output :exports both
    add = lambda x, y: x + y

    print add(2, 3)
  #+END_SRC

  #+RESULTS:
  : 5

  排序时的key函数：
  #+BEGIN_SRC python :results output :exports both
    a = [(1, 2), (4, 1), (9, 10), (13, -3)]
    a.sort(key=lambda x: x[1])
    print a

    a.sort(key=lambda x: x[0])
    print a

    print sorted(a, key=lambda x: x[1])


  #+END_SRC

  #+RESULTS:
  : [(13, -3), (4, 1), (1, 2), (9, 10)]
  : [(1, 2), (4, 1), (9, 10), (13, -3)]
  : [(13, -3), (4, 1), (1, 2), (9, 10)]

  #+BEGIN_SRC python :results output :exports both
    list1 = [9, 7, 5]
    list2 = [10, 8, 6]

    data = zip(list1, list2)
    print data
    data.sort()
    print data
    print '================'
    print zip(*data)
    list1, list2 = map(lambda t: list(t), zip(*data))
    print '################'
    print list1
    print list2
  #+END_SRC

  #+RESULTS:
  : [(9, 10), (7, 8), (5, 6)]
  : [(5, 6), (7, 8), (9, 10)]
  : ================
  : [(5, 7, 9), (6, 8, 10)]
  : ################
  : [5, 7, 9]
  : [6, 8, 10]

