archive/before-2018-11-10/2017-07-05-python进阶笔记.html

<div id="outline-container-org594bf4f" class="outline-3">
<h3 id="org594bf4f"><span class="section-number-3">1.4</span> namedtuple</h3>
<div class="outline-text-3" id="text-1-4">
<p>
命名元组和元组一样，都是不可变的。但是你可以不用索引来访问其中的元
素，可以像字典一样去访问它。
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> namedtuple

     <span style="color: #ff8700;">Animal</span> = namedtuple(<span style="color: #ff4ea3;">'Animal'</span>, <span style="color: #ff4ea3;">'name age type'</span>)
     <span style="color: #ff8700;">perry</span> = Animal(name=<span style="color: #ff4ea3;">"perry"</span>, age=31, <span style="color: #d18aff;">type</span>=<span style="color: #ff4ea3;">"cat"</span>)

     <span style="color: #a1db00;">print</span>(perry)
     <span style="color: #a1db00;">print</span> perry.name
     <span style="color: #a1db00;">print</span> perry.age

     <span style="color: #ff8700;">d</span> = {<span style="color: #ff4ea3;">'xie'</span>: <span style="color: #ff4ea3;">'peng'</span>}
     <span style="color: #a1db00;">print</span> d[<span style="color: #ff4ea3;">'xie'</span>]
     <span style="color: #a1db00;">print</span> d.get(<span style="color: #ff4ea3;">'xie'</span>)
</pre>
</div>

<p>
元组的属性值是不可变的，下面的代码会出问题：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> namedtuple

     <span style="color: #ff8700;">test</span> = namedtuple(<span style="color: #ff4ea3;">'test'</span>, <span style="color: #ff4ea3;">'name age'</span>)
     <span style="color: #ff8700;">d</span> = test(name=<span style="color: #ff4ea3;">'xiepeng'</span>, age=27)
     <span style="color: #ff8700;">d.age</span> = 1
</pre>
</div>

<p>
命名元组很轻量，和元组占用差不多的内存。它比字典更快。
</p>

<p>
它也可以通过索引来访问元素，所以它其实是向后兼容元组的。
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> namedtuple

     <span style="color: #ff8700;">Animal</span> = namedtuple(<span style="color: #ff4ea3;">'Animal'</span>, <span style="color: #ff4ea3;">'name age type'</span>)
     <span style="color: #ff8700;">perry</span> = Animal(name=<span style="color: #ff4ea3;">"perry"</span>, age=31, <span style="color: #d18aff;">type</span>=<span style="color: #ff4ea3;">"cat"</span>)
     <span style="color: #a1db00;">print</span>(perry[0])
     <span style="color: #a1db00;">print</span>(perry[1])
</pre>
</div>

<p>
命名元组还可以转换为字典：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> namedtuple


     <span style="color: #ff8700;">test</span> = namedtuple(<span style="color: #ff4ea3;">'test'</span>, <span style="color: #ff4ea3;">'name age'</span>)

     <span style="color: #ff8700;">a</span> = test(name=<span style="color: #ff4ea3;">'xie'</span>, age=27)
     <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">type</span>(a)
     <span style="color: #a1db00;">print</span> a
     <span style="color: #ff8700;">d</span> = a._asdict()
     <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">type</span>(d)
     <span style="color: #a1db00;">print</span> d

</pre>
</div>
</div>
</div>

<div id="outline-container-org610968d" class="outline-3">
<h3 id="org610968d"><span class="section-number-3">1.5</span> enum.Enum</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">-*- coding: utf-8; -*-</span>
     <span style="color: #a1db00;">from</span> collections <span style="color: #a1db00;">import</span> namedtuple
     <span style="color: #a1db00;">from</span> enum <span style="color: #a1db00;">import</span> Enum

     <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Species</span>(Enum):
         <span style="color: #ff8700;">cat</span> = 1
         <span style="color: #ff8700;">dog</span> = 2
         <span style="color: #ff8700;">horse</span> = 3
         <span style="color: #ff8700;">aardvark</span> = 4
         <span style="color: #ff8700;">butterfly</span> = 5
         <span style="color: #ff8700;">owl</span> = 6
         <span style="color: #ff8700;">platypus</span> = 7
         <span style="color: #ff8700;">dragon</span> = 8
         <span style="color: #ff8700;">unicorn</span> = 9
         <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#20381;&#27425;&#31867;&#25512;</span>

         <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#20294;&#25105;&#20204;&#24182;&#19981;&#24819;&#20851;&#24515;&#21516;&#19968;&#29289;&#31181;&#30340;&#24180;&#40836;&#65292;&#25152;&#20197;&#25105;&#20204;&#21487;&#20197;&#20351;&#29992;&#19968;&#20010;&#21035;&#21517;</span>
         <span style="color: #ff8700;">kitten</span> = 1  <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">(&#35793;&#32773;&#27880;&#65306;&#24188;&#23567;&#30340;&#29483;&#21674;)</span>
         <span style="color: #ff8700;">puppy</span> = 2   <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">(&#35793;&#32773;&#27880;&#65306;&#24188;&#23567;&#30340;&#29399;&#29399;)</span>

     <span style="color: #ff8700;">Animal</span> = namedtuple(<span style="color: #ff4ea3;">'Animal'</span>, <span style="color: #ff4ea3;">'name age type'</span>)
     <span style="color: #ff8700;">perry</span> = Animal(name=<span style="color: #ff4ea3;">"Perry"</span>, age=31, <span style="color: #d18aff;">type</span>=Species.cat)
     <span style="color: #ff8700;">drogon</span> = Animal(name=<span style="color: #ff4ea3;">"Drogon"</span>, age=4, <span style="color: #d18aff;">type</span>=Species.dragon)
     <span style="color: #ff8700;">tom</span> = Animal(name=<span style="color: #ff4ea3;">"Tom"</span>, age=75, <span style="color: #d18aff;">type</span>=Species.cat)
     <span style="color: #ff8700;">charlie</span> = Animal(name=<span style="color: #ff4ea3;">"Charlie"</span>, age=2, <span style="color: #d18aff;">type</span>=Species.kitten)

     <span style="color: #a1db00;">print</span> charlie.<span style="color: #d18aff;">type</span> == tom.<span style="color: #d18aff;">type</span>
     <span style="color: #a1db00;">print</span> charlie.<span style="color: #d18aff;">type</span>

     <span style="color: #a1db00;">print</span> Species(1)
     <span style="color: #a1db00;">print</span> Species[<span style="color: #ff4ea3;">'cat'</span>]
     <span style="color: #a1db00;">print</span> Species.cat

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9807038" class="outline-2">
<h2 id="org9807038"><span class="section-number-2">2</span> lambda</h2>
<div class="outline-text-2" id="text-2">
<p>
和elisp一样，它就是匿名函数。其函数原型如下：
</p>
<pre class="example">
    lambda 参数:操作(参数)
</pre>

<p>
例子：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">add</span> = <span style="color: #a1db00;">lambda</span> x, y: x + y

    <span style="color: #a1db00;">print</span> add(2, 3)
</pre>
</div>

<p>
排序时的key函数：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">a</span> = [(1, 2), (4, 1), (9, 10), (13, -3)]
    a.sort(key=<span style="color: #a1db00;">lambda</span> x: x[1])
    <span style="color: #a1db00;">print</span> a

    a.sort(key=<span style="color: #a1db00;">lambda</span> x: x[0])
    <span style="color: #a1db00;">print</span> a

    <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">sorted</span>(a, key=<span style="color: #a1db00;">lambda</span> x: x[1])


</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">list1</span> = [9, 7, 5]
    <span style="color: #ff8700;">list2</span> = [10, 8, 6]

    <span style="color: #ff8700;">data</span> = <span style="color: #d18aff;">zip</span>(list1, list2)
    <span style="color: #a1db00;">print</span> data
    data.sort()
    <span style="color: #a1db00;">print</span> data
    <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'================'</span>
    <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">zip</span>(*data)
    <span style="color: #ff8700;">list1</span>, <span style="color: #ff8700;">list2</span> = <span style="color: #d18aff;">map</span>(<span style="color: #a1db00;">lambda</span> t: <span style="color: #d18aff;">list</span>(t), <span style="color: #d18aff;">zip</span>(*data))
    <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'################'</span>
    <span style="color: #a1db00;">print</span> list1
    <span style="color: #a1db00;">print</span> list2
</pre>
</div>
</div>
</div>
