wiki/python进阶笔记.org
* 推导式
  :PROPERTIES:
  :CUSTOM_ID: tuidaoshi
  :END:
  集合推导式
  #+BEGIN_SRC python :results output :exports both
    squared = {x**2 for x in [1, 1, 2]}
    print(squared)
  #+END_SRC

  列表推导式：
  #+BEGIN_SRC python :results output :exports both
    multiples = [i for i in range(30) if i % 3 is 0]
    print(multiples)

    squared = []
    for x in range(10):
        squared.append(x**2)
    print squared

    squared2 = [x**2 for x in range(10)]
    print squared2
  #+END_SRC

  #+RESULTS:
  : [0, 3, 6, 9, 12, 15, 18, 21, 24, 27]
  : [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]
  : [0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

  字典推导式：
  #+BEGIN_SRC python :results output :exports both
    mcase = {'a': 10, 'b': 34, 'A': 7, 'Z': 3}

    mcase_frequency = {
        k.lower(): mcase.get(k.lower(), 0) + mcase.get(k.upper(), 0)
        for k in mcase.keys()
    }
    print mcase_frequency
  #+END_SRC

  #+RESULTS:
  : {'a': 17, 'z': 3, 'b': 34}

  可以使用来对换一个字典的键值：
  #+BEGIN_SRC python :results output :exports both
    d = {
        'xie': 'peng',
        'hi': 'hao'
    }

    print d
    print {v: k for k, v in d.items()}
  #+END_SRC

  #+RESULTS:
  : {'hi': 'hao', 'xie': 'peng'}
  : {'peng': 'xie', 'hao': 'hi'}

* 上下文管理
  使用with进行上下文管理，非常方便：
  #+BEGIN_SRC python :results output
    with open('xxx', 'rb') as f:
        f.read()
        ...
  #+END_SRC

  可以自己定义上下文管理器：
  #+BEGIN_SRC python :results output :exports both
    class File(object):
        def __init__(self, filename, method):
            self.file_obj = open(filename, method)

        def __enter__(self):
            return self.file_obj

        def __exit__(self, type, value, traceback):
            self.file_obj.close()


    with File('/tmp/kk.txt', 'r') as f:
        print f.read()
  #+END_SRC
  它真的起作用了！
  
  大概的过程：
  1. =with= 先暂存下 =__exit__= 方法。
  2. 调用 =__enter__= 方法，把它的返回值赋给 =f= 。
  3. 通过f执行对应的操作。
  4. 最后 =with= 语句调用 =__exit__= 做后续处理，这里就是直接关闭文件
     句柄。
  
  下面我们来看下 =__exit__= 的其它几个参数，如果在 =with= 执行的时候发
  生了异常，它会将异常的 =type, value, traceback= 都传递给 =__exit__=
  。让它来处理异常。两种情况：
  1. 如果 =__exit__= 返回的是True，那么这个异常就被优雅地处理了。
  2. 如果 =exit__= 返回的是True以外的任何东西，那么这个异常将被 =with=
     语句抛出。

  
  下面这个例子我们就自己handle了错误：
  #+BEGIN_SRC python :results output :exports both
    class File(object):
        def __init__(self, file_name, method):
            self.file_obj = open(file_name, method)
        def __enter__(self):
            return self.file_obj
        def __exit__(self, type, value, traceback):

            print("Exception has been handled")
            print type
            print value
            print traceback

            self.file_obj.close()
            return True

    with File('demo.txt', 'w') as opened_file:
        opened_file.undefined_function()
  #+END_SRC

  #+RESULTS:
  : Exception has been handled
  : <type 'exceptions.AttributeError'>
  : 'file' object has no attribute 'undefined_function'
  : <traceback object at 0x100762638>
  
  还可以使用生成器和装钸器来实现上下文管理。Python有个contextlib模块专
  门用于这个目的。我们可以使用一个生成器函数来实现一个上下文管理器，而
  不是使用一个类。
  #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
    from contextlib import contextmanager

    @contextmanager
    def open_file(name):
        f = open(name, 'w')
        yield f
        f.close()
  #+END_SRC

