archive/before-2018-11-10/2017-07-05-python进阶笔记.html

<div id="outline-container-orge642d64" class="outline-2">
<h2 id="tuidaoshi"><a id="orge642d64"></a><span class="section-number-2">3</span> 推导式</h2>
<div class="outline-text-2" id="text-tuidaoshi">
<p>
集合推导式
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">squared</span> = {x**2 <span style="color: #a1db00;">for</span> x <span style="color: #a1db00;">in</span> [1, 1, 2]}
    <span style="color: #a1db00;">print</span>(squared)
</pre>
</div>

<p>
列表推导式：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">multiples</span> = [i <span style="color: #a1db00;">for</span> i <span style="color: #a1db00;">in</span> <span style="color: #d18aff;">range</span>(30) <span style="color: #a1db00;">if</span> i % 3 <span style="color: #a1db00;">is</span> 0]
    <span style="color: #a1db00;">print</span>(multiples)

    <span style="color: #ff8700;">squared</span> = []
    <span style="color: #a1db00;">for</span> x <span style="color: #a1db00;">in</span> <span style="color: #d18aff;">range</span>(10):
        squared.append(x**2)
    <span style="color: #a1db00;">print</span> squared

    <span style="color: #ff8700;">squared2</span> = [x**2 <span style="color: #a1db00;">for</span> x <span style="color: #a1db00;">in</span> <span style="color: #d18aff;">range</span>(10)]
    <span style="color: #a1db00;">print</span> squared2
</pre>
</div>

<p>
字典推导式：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">mcase</span> = {<span style="color: #ff4ea3;">'a'</span>: 10, <span style="color: #ff4ea3;">'b'</span>: 34, <span style="color: #ff4ea3;">'A'</span>: 7, <span style="color: #ff4ea3;">'Z'</span>: 3}

    <span style="color: #ff8700;">mcase_frequency</span> = {
        k.lower(): mcase.get(k.lower(), 0) + mcase.get(k.upper(), 0)
        <span style="color: #a1db00;">for</span> k <span style="color: #a1db00;">in</span> mcase.keys()
    }
    <span style="color: #a1db00;">print</span> mcase_frequency
</pre>
</div>

<p>
可以使用来对换一个字典的键值：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">d</span> = {
        <span style="color: #ff4ea3;">'xie'</span>: <span style="color: #ff4ea3;">'peng'</span>,
        <span style="color: #ff4ea3;">'hi'</span>: <span style="color: #ff4ea3;">'hao'</span>
    }

    <span style="color: #a1db00;">print</span> d
    <span style="color: #a1db00;">print</span> {v: k <span style="color: #a1db00;">for</span> k, v <span style="color: #a1db00;">in</span> d.items()}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3920d8e" class="outline-2">
<h2 id="org3920d8e"><span class="section-number-2">4</span> 上下文管理</h2>
<div class="outline-text-2" id="text-4">
<p>
使用with进行上下文管理，非常方便：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">with</span> <span style="color: #d18aff;">open</span>(<span style="color: #ff4ea3;">'xxx'</span>, <span style="color: #ff4ea3;">'rb'</span>) <span style="color: #a1db00;">as</span> f:
        f.read()
        ...
</pre>
</div>

<p>
可以自己定义上下文管理器：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">File</span>(<span style="color: #d18aff;">object</span>):
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__init__</span>(<span style="color: #a1db00;">self</span>, filename, method):
            <span style="color: #a1db00;">self</span>.file_obj = <span style="color: #d18aff;">open</span>(filename, method)

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__enter__</span>(<span style="color: #a1db00;">self</span>):
            <span style="color: #a1db00;">return</span> <span style="color: #a1db00;">self</span>.file_obj

        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__exit__</span>(<span style="color: #a1db00;">self</span>, <span style="color: #d18aff;">type</span>, value, traceback):
            <span style="color: #a1db00;">self</span>.file_obj.close()


    <span style="color: #a1db00;">with</span> File(<span style="color: #ff4ea3;">'/tmp/kk.txt'</span>, <span style="color: #ff4ea3;">'r'</span>) <span style="color: #a1db00;">as</span> f:
        <span style="color: #a1db00;">print</span> f.read()
</pre>
</div>

<p>
它真的起作用了！
</p>

<p>
大概的过程：
</p>
<ol class="org-ol">
<li><code>with</code> 先暂存下 <code>__exit__</code> 方法。</li>
<li>调用 <code>__enter__</code> 方法，把它的返回值赋给 <code>f</code> 。</li>
<li>通过f执行对应的操作。</li>
<li>最后 <code>with</code> 语句调用 <code>__exit__</code> 做后续处理，这里就是直接关闭文件
句柄。</li>
</ol>

<p>
下面我们来看下 <code>__exit__</code> 的其它几个参数，如果在 <code>with</code> 执行的时候发
生了异常，它会将异常的 <code>type, value, traceback</code> 都传递给 <code>__exit__</code>
。让它来处理异常。两种情况：
</p>
<ol class="org-ol">
<li>如果 <code>__exit__</code> 返回的是True，那么这个异常就被优雅地处理了。</li>
<li>如果 <code>exit__</code> 返回的是True以外的任何东西，那么这个异常将被 <code>with</code>
语句抛出。</li>
</ol>


<p>
下面这个例子我们就自己handle了错误：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">File</span>(<span style="color: #d18aff;">object</span>):
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__init__</span>(<span style="color: #a1db00;">self</span>, file_name, method):
            <span style="color: #a1db00;">self</span>.file_obj = <span style="color: #d18aff;">open</span>(file_name, method)
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__enter__</span>(<span style="color: #a1db00;">self</span>):
            <span style="color: #a1db00;">return</span> <span style="color: #a1db00;">self</span>.file_obj
        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__exit__</span>(<span style="color: #a1db00;">self</span>, <span style="color: #d18aff;">type</span>, value, traceback):

            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">"Exception has been handled"</span>)
            <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">type</span>
            <span style="color: #a1db00;">print</span> value
            <span style="color: #a1db00;">print</span> traceback

            <span style="color: #a1db00;">self</span>.file_obj.close()
            <span style="color: #a1db00;">return</span> <span style="color: #5fafd7;">True</span>

    <span style="color: #a1db00;">with</span> File(<span style="color: #ff4ea3;">'demo.txt'</span>, <span style="color: #ff4ea3;">'w'</span>) <span style="color: #a1db00;">as</span> opened_file:
        opened_file.undefined_function()
</pre>
</div>

<p>
还可以使用生成器和装钸器来实现上下文管理。Python有个contextlib模块专
门用于这个目的。我们可以使用一个生成器函数来实现一个上下文管理器，而
不是使用一个类。
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">from</span> contextlib <span style="color: #a1db00;">import</span> contextmanager

    <span style="color: #00d7af;">@contextmanager</span>
    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">open_file</span>(name):
        <span style="color: #ff8700;">f</span> = <span style="color: #d18aff;">open</span>(name, <span style="color: #ff4ea3;">'w'</span>)
        <span style="color: #a1db00;">yield</span> f
        f.close()
</pre>
</div>
</div>
</div>
