archive/before-2018-11-10/2017-07-05-python进阶笔记.html

<div id="outline-container-org4d74ffe" class="outline-2">
<h2 id="org4d74ffe"><span class="section-number-2">6</span> 函数式编程</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org0852b6a" class="outline-3">
<h3 id="org0852b6a"><span class="section-number-3">6.1</span> Map</h3>
<div class="outline-text-3" id="text-6-1">
<p>
把一个函数映射到一个列表中的每个元素。一般和匿名函数（lambda）结合
使用。先看看下面这段代码：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #ff8700;">items</span> = [1, 2, 3, 4, 5]
     <span style="color: #ff8700;">squared</span> = []
     <span style="color: #a1db00;">for</span> i <span style="color: #a1db00;">in</span> items:
         squared.append(i**2)
     <span style="color: #a1db00;">print</span> squared
</pre>
</div>

<p>
修改为map后可以这样：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #ff8700;">items</span> = [1, 2, 3, 4, 5]
     <span style="color: #ff8700;">squared</span> = <span style="color: #d18aff;">list</span>(<span style="color: #d18aff;">map</span>(<span style="color: #a1db00;">lambda</span> x: x**2, items))
     <span style="color: #a1db00;">print</span> squared
</pre>
</div>

<p>
map不仅可以应用到全是数据的列表，还可以应用到全是函数的列表上（因为
函数式编程可以把函数也理解为数据，所以其实这两种也没差）：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">-*- coding: utf-8; -*-</span>
     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">add</span>(x):
         <span style="color: #a1db00;">return</span> x + x

     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">multi</span>(x):
         <span style="color: #a1db00;">return</span> x * x

     <span style="color: #ff8700;">f</span> = [add, multi]

     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#36825;&#37324;&#30340;x&#20998;&#21035;&#23601;&#26159;&#19978;&#38754;&#30340;&#20989;&#25968;&#65292;&#19968;&#20010;&#19968;&#20010;&#36827;&#34892;&#35843;&#29992;&#32599;</span>
     <span style="color: #ff8700;">value</span> = <span style="color: #d18aff;">map</span>(<span style="color: #a1db00;">lambda</span> x: x(3), f)

     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#36825;&#37324;&#21152;&#20102;list&#36716;&#25442;&#65292;&#20026;&#20102;&#20860;&#23481;&#65292;python2&#20013;map&#36820;&#22238;&#21015;&#34920;&#65292;3&#20013;map&#36820;&#22238;&#36845;&#20195;&#22120;&#12290;</span>
     <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">list</span>(value)
</pre>
</div>

<p>
map写一个把所有list中字符串转换为首字母大写其它小写的形式：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">f</span>(x):
         <span style="color: #ff8700;">a</span> = x.lower()
         <span style="color: #a1db00;">return</span> <span style="color: #ff4ea3;">''</span>.join(a[0].upper()) + a[1:]

     <span style="color: #ff8700;">b</span> = [<span style="color: #ff4ea3;">'XIE'</span>, <span style="color: #ff4ea3;">'sd'</span>, <span style="color: #ff4ea3;">'PDFJAF'</span>, <span style="color: #ff4ea3;">'aaaaaaaasdfasDSFFDSAF'</span>]
     <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">map</span>(f, b)
</pre>
</div>
</div>
</div>

<div id="outline-container-org5050cea" class="outline-3">
<h3 id="org5050cea"><span class="section-number-3">6.2</span> Filter</h3>
<div class="outline-text-3" id="text-6-2">
<p>
和map类似的用法，它可以过滤满足条件的元素出来。
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #ff8700;">num</span> = [-5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5]
     <span style="color: #ff8700;">value</span> = <span style="color: #d18aff;">filter</span>(<span style="color: #a1db00;">lambda</span> x: x &lt; 0, num)
     <span style="color: #a1db00;">print</span>(<span style="color: #d18aff;">list</span>(value))
</pre>
</div>

<p>
filter是内置函数，它类似于for，但是更快。但是大部分情况下，还是 <a href="#tuidaoshi">推导式</a>  更优雅一些。
</p>
</div>
</div>

<div id="outline-container-orga9655c6" class="outline-3">
<h3 id="orga9655c6"><span class="section-number-3">6.3</span> Reduce</h3>
<div class="outline-text-3" id="text-6-3">
<p>
reduce把一个函数作用在一个序列[x1, x2, x3&#x2026;]上，这个函数必须接收两
个参数，reduce把结果继续和序列的下一个元素做累积计算，其效果就是：
</p>
<pre class="example">
     reduce(f, [x1, x2, x3, x4]) = f(f(f(x1, x2), x3), x4)
</pre>

<p>
这样的话写一个求和的函数可以这样：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #ff8700;">a</span> = <span style="color: #d18aff;">range</span>(201)
     <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">reduce</span>((<span style="color: #a1db00;">lambda</span> x, y: x + y), a)
</pre>
</div>

<p>
reduce求积：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">fun</span>(l):
         <span style="color: #a1db00;">return</span> <span style="color: #d18aff;">reduce</span>((<span style="color: #a1db00;">lambda</span> x, y:x * y), l)

     <span style="color: #a1db00;">print</span> fun(<span style="color: #d18aff;">range</span>(1, 5))
</pre>
</div>

<p>
把 <code>[1, 3, 5, 7, 9]</code> 转换为13579可以这样：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #ff8700;">a</span> = [1, 3, 5, 7, 9]
     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">f</span>(x, y):
         <span style="color: #a1db00;">return</span> x * 10 + y

     <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">reduce</span>(f, a)
</pre>
</div>

<p>
因为字符串也是一个序列，那么加上map我们可以这样搞一个字符串转换数字
的函数：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">fn</span>(x, y):
         <span style="color: #a1db00;">return</span> x * 10 + y

     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">char2num</span>(s):
         <span style="color: #a1db00;">return</span> {<span style="color: #ff4ea3;">'0'</span>: 0,
                 <span style="color: #ff4ea3;">'1'</span>: 1,
                 <span style="color: #ff4ea3;">'2'</span>: 2,
                 <span style="color: #ff4ea3;">'3'</span>: 3,
                 <span style="color: #ff4ea3;">'4'</span>: 4,
                 <span style="color: #ff4ea3;">'5'</span>: 5,
                 <span style="color: #ff4ea3;">'6'</span>: 6,
                 <span style="color: #ff4ea3;">'7'</span>: 7,
                 <span style="color: #ff4ea3;">'8'</span>: 8,
                 <span style="color: #ff4ea3;">'9'</span>: 9,
         }[s]

     <span style="color: #ff8700;">a</span> = <span style="color: #d18aff;">map</span>(char2num, <span style="color: #ff4ea3;">'13579'</span>)
     <span style="color: #ff8700;">b</span> = <span style="color: #d18aff;">reduce</span>(fn, <span style="color: #d18aff;">map</span>(char2num, <span style="color: #ff4ea3;">'13579'</span>))
     <span style="color: #a1db00;">print</span> a
     <span style="color: #a1db00;">print</span> b
     <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">type</span>(b)
</pre>
</div>

<p>
整合起来弄成一个函数就可以是这样：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">mystr2int</span>(s):
         <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">fn</span>(x, y):
             <span style="color: #a1db00;">return</span> x * 10 + y

         <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">char2num</span>(s):
             <span style="color: #a1db00;">return</span> {<span style="color: #ff4ea3;">'0'</span>: 0,
                     <span style="color: #ff4ea3;">'1'</span>: 1,
                     <span style="color: #ff4ea3;">'2'</span>: 2,
                     <span style="color: #ff4ea3;">'3'</span>: 3,
                     <span style="color: #ff4ea3;">'4'</span>: 4,
                     <span style="color: #ff4ea3;">'5'</span>: 5,
                     <span style="color: #ff4ea3;">'6'</span>: 6,
                     <span style="color: #ff4ea3;">'7'</span>: 7,
                     <span style="color: #ff4ea3;">'8'</span>: 8,
                     <span style="color: #ff4ea3;">'9'</span>: 9,
             }[s]

         <span style="color: #a1db00;">return</span> <span style="color: #d18aff;">reduce</span>(fn, <span style="color: #d18aff;">map</span>(char2num, s))

     <span style="color: #ff8700;">result</span> = mystr2int(<span style="color: #ff4ea3;">'13579'</span>)
     <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">type</span>(result), result
</pre>
</div>
</div>
</div>
</div>
