wiki/python进阶笔记.org
* set 数据结构
  它与列表类似，但是不能包括重复的值，它可以根据一个list来初始化：
  #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
    l = [1, 2, 3, 4, 1]
    s = set(l)
    print l
    print s
  #+END_SRC

  #+RESULTS:
  : [1, 2, 3, 4, 1]
  : set([1, 2, 3, 4])

  求交集：
  #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
    a = set([1, 2, 3, 4, 5])
    b = set([3, 5])
    print a.intersection(b)
    print a & b
  #+END_SRC

  #+RESULTS:
  : set([3, 5])
  : set([3, 5])

  差集：
  #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
    a = set([1, 2, 3, 4, 5])
    b = set([3, 5])

    print a - b
  #+END_SRC

  #+RESULTS:
  : set([1, 2, 4])

  并集：
  #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
    a = set([1, 2, 3, 4, 5])
    b = set([3, 5, 7])

    print a | b
  #+END_SRC

  #+RESULTS:
  : set([1, 2, 3, 4, 5, 7])

  
  还可以使用符号来创建集合：
  #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
    a_set = {'red', 'blue'}
    print type(a_set)
  #+END_SRC

  #+RESULTS:
  : <type 'set'>

* 三元运算符
  看看下面的例子：
  #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
    a = True
    b = 'yes' if a else 'no'
    print b

    a = False
    b = 'yes' if a else 'no'
    print b
  #+END_SRC

* Global
  #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
    def fun():
        global s
        print 'this is in fun'
        s = range(10)

    fun()
    print s
  #+END_SRC
  在函数内部使用 =global= 来声明变量，可以使该变量在全局范围都能访问。
  但是一般应该避免这样使用。

* 可变对象和不可变对象
  :PROPERTIES:
  :CUSTOM_ID: mutable_or_unmutable
  :END:
  可变就是可以被改动，不可变就是常量的意思。
  #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
    foo = ['hi']
    bar = foo
    foo += ['xie']
    print bar
  #+END_SRC
  其实这两个变量指向的只是同一个东西啦。再来看下下面的例子：
  #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
    def add_to(num, target=[]):
        target.append(num)
        return target

    print add_to(1)
    # Output: [1]

    print add_to(2)
    # Output: [2]

    print add_to(3)
    # Output: [3]
  #+END_SRC

  #+RESULTS:
  : [1]
  : [1, 2]
  : [1, 2, 3]

  为什么这里还是一个累加的结果呢？因为在python中当函数被定义时，默认参
  数只会被调用一次，而不是每次调用都会重新运算。 *应该永远不要定义一个
  可变类型的默认参数，除非你知道你在做什么。* 上面的例子要实现不累加的
  效果，需要这样做：
  #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
    def addto(num, target=None):
        if target == None:
            target = []

        target.append(num)
        return target

    print addto(1)
    print addto(2)
    print addto(3)
  #+END_SRC

  #+RESULTS:
  : [1]
  : [2]
  : [3]

