archive/before-2018-11-10/2017-07-05-python进阶笔记.html

<div id="outline-container-org9da6a5b" class="outline-2">
<h2 id="org9da6a5b"><span class="section-number-2">7</span> set 数据结构</h2>
<div class="outline-text-2" id="text-7">
<p>
它与列表类似，但是不能包括重复的值，它可以根据一个list来初始化：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">l</span> = [1, 2, 3, 4, 1]
    <span style="color: #ff8700;">s</span> = <span style="color: #d18aff;">set</span>(l)
    <span style="color: #a1db00;">print</span> l
    <span style="color: #a1db00;">print</span> s
</pre>
</div>

<p>
求交集：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">a</span> = <span style="color: #d18aff;">set</span>([1, 2, 3, 4, 5])
    <span style="color: #ff8700;">b</span> = <span style="color: #d18aff;">set</span>([3, 5])
    <span style="color: #a1db00;">print</span> a.intersection(b)
    <span style="color: #a1db00;">print</span> a &amp; b
</pre>
</div>

<p>
差集：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">a</span> = <span style="color: #d18aff;">set</span>([1, 2, 3, 4, 5])
    <span style="color: #ff8700;">b</span> = <span style="color: #d18aff;">set</span>([3, 5])

    <span style="color: #a1db00;">print</span> a - b
</pre>
</div>

<p>
并集：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">a</span> = <span style="color: #d18aff;">set</span>([1, 2, 3, 4, 5])
    <span style="color: #ff8700;">b</span> = <span style="color: #d18aff;">set</span>([3, 5, 7])

    <span style="color: #a1db00;">print</span> a | b
</pre>
</div>

<p>
还可以使用符号来创建集合：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">a_set</span> = {<span style="color: #ff4ea3;">'red'</span>, <span style="color: #ff4ea3;">'blue'</span>}
    <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">type</span>(a_set)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8ef82e" class="outline-2">
<h2 id="orgb8ef82e"><span class="section-number-2">8</span> 三元运算符</h2>
<div class="outline-text-2" id="text-8">
<p>
看看下面的例子：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">a</span> = <span style="color: #5fafd7;">True</span>
    <span style="color: #ff8700;">b</span> = <span style="color: #ff4ea3;">'yes'</span> <span style="color: #a1db00;">if</span> a <span style="color: #a1db00;">else</span> <span style="color: #ff4ea3;">'no'</span>
    <span style="color: #a1db00;">print</span> b

    <span style="color: #ff8700;">a</span> = <span style="color: #5fafd7;">False</span>
    <span style="color: #ff8700;">b</span> = <span style="color: #ff4ea3;">'yes'</span> <span style="color: #a1db00;">if</span> a <span style="color: #a1db00;">else</span> <span style="color: #ff4ea3;">'no'</span>
    <span style="color: #a1db00;">print</span> b
</pre>
</div>
</div>
</div>

<div id="outline-container-orgadec6a5" class="outline-2">
<h2 id="orgadec6a5"><span class="section-number-2">9</span> Global</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">fun</span>():
        <span style="color: #a1db00;">global</span> s
        <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'this is in fun'</span>
        <span style="color: #ff8700;">s</span> = <span style="color: #d18aff;">range</span>(10)

    fun()
    <span style="color: #a1db00;">print</span> s
</pre>
</div>

<p>
在函数内部使用 <code>global</code> 来声明变量，可以使该变量在全局范围都能访问。
但是一般应该避免这样使用。
</p>
</div>
</div>

<div id="outline-container-org77b50a2" class="outline-2">
<h2 id="mutable_or_unmutable"><a id="org77b50a2"></a><span class="section-number-2">10</span> 可变对象和不可变对象</h2>
<div class="outline-text-2" id="text-mutable_or_unmutable">
<p>
可变就是可以被改动，不可变就是常量的意思。
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #ff8700;">foo</span> = [<span style="color: #ff4ea3;">'hi'</span>]
    <span style="color: #ff8700;">bar</span> = foo
    <span style="color: #ff8700;">foo</span> += [<span style="color: #ff4ea3;">'xie'</span>]
    <span style="color: #a1db00;">print</span> bar
</pre>
</div>

<p>
其实这两个变量指向的只是同一个东西啦。再来看下下面的例子：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">add_to</span>(num, target=[]):
        target.append(num)
        <span style="color: #a1db00;">return</span> target

    <span style="color: #a1db00;">print</span> add_to(1)
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Output: [1]</span>

    <span style="color: #a1db00;">print</span> add_to(2)
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Output: [2]</span>

    <span style="color: #a1db00;">print</span> add_to(3)
    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Output: [3]</span>
</pre>
</div>

<p>
为什么这里还是一个累加的结果呢？因为在python中当函数被定义时，默认参
数只会被调用一次，而不是每次调用都会重新运算。 <b>应该永远不要定义一个
可变类型的默认参数，除非你知道你在做什么。</b> 上面的例子要实现不累加的
效果，需要这样做：
</p>
<div class="org-src-container">
<pre class="src src-python">    <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">addto</span>(num, target=<span style="color: #5fafd7;">None</span>):
        <span style="color: #a1db00;">if</span> target == <span style="color: #5fafd7;">None</span>:
            <span style="color: #ff8700;">target</span> = []

        target.append(num)
        <span style="color: #a1db00;">return</span> target

    <span style="color: #a1db00;">print</span> addto(1)
    <span style="color: #a1db00;">print</span> addto(2)
    <span style="color: #a1db00;">print</span> addto(3)
</pre>
</div>
</div>
