wiki/python进阶笔记.org
** 总结可变类型和不可变类型
   不可变类型：
   1. 元组 =(1, 2)= 。
   2. string ：可以发现s和d都是指向的同一块内存。但是使用切片后，c其实
      是copy出来。
      #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
        s = 'xiepeng'
        d = 'xiepeng'
        print id(s)
        print id(d)

        c = d[1:]
        print id(s)
        print id(d)
        print id(c)
      #+END_SRC

      #+RESULTS:
      : 4302740576
      : 4302740576
      : 4302740576
      : 4302740576
      : 4302740624
   3. int和float。77在内存中是同一块地址，但是 =j+1= ，其实也是执行了
      copy的动作。
      #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
        def int_test(): 
            i = 77
            j = 77
            print(id(77))                    #140396579590760
            print('i id:' + str(id(i)))      #i id:140396579590760
            print('j id:' + str(id(j)))      #j id:140396579590760
            print i is j                     #True
            j = j + 1
            print('new i id:' + str(id(i)))  #new i id:140396579590760
            print('new j id:' + str(id(j)))  #new j id:140396579590736
            print i is j                     #False

        if __name__ == '__main__':
            int_test()
      #+END_SRC

      #+RESULTS:
      : 4298165080
      : i id:4298165080
      : j id:4298165080
      : True
      : new i id:4298165080
      : new j id:4298165056
      : False

   可变类型：
   1. dict和list。因为是可变的，所以这里没有拷贝。都是在一块内存里搞事
      情。
      #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
        def dict_test():
            a = {}
            b = a
            print(id(a))
            a['a'] = 'hhhh'
            print('id a:' + str(id(a)))
            print('a:' + str(a))
            print('id b:' + str(id(b)))
            print('b:' + str(b))

        if __name__ == '__main__':
            dict_test()
      #+END_SRC

      #+RESULTS:
      : 4302741864
      : id a:4302741864
      : a:{'a': 'hhhh'}
      : id b:4302741864
      : b:{'a': 'hhhh'}

   python函数调用的时候都是传递的引用，也就是传给函数原变量实际指向的
   内存空间。如果传递的是可变参数类型，在函数内部对该参数的修改会体现
   到原变量上。这样会出问题的。应避免。
   #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
     def fun(x):
         print 'inter x = %s before modify' % x
         x.append(5)
         print 'inter x = %s after modify' % x
    

     a = [1,2,3]
     print 'outer before function a = %s' % a
     fun(a)
     print 'outer after function a = %s' % a
   #+END_SRC

   #+RESULTS:
   : outer before function a = [1, 2, 3]
   : inter x = [1, 2, 3] before modify
   : inter x = [1, 2, 3, 5] after modify
   : outer after function a = [1, 2, 3, 5]

   换成不可变类型的string表现就正常了。
   #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
     def fun(x):
         print 'inter x = [{s}] before modify'.format(s=x)
         x = x + 'end'
         print 'inter x = [{s}] after modify'.format(s=x)


     a = 'xie'
     print 'outer before function a = [{s}]'.format(s=a)
     fun(a)
     print 'outer after function a = [{s}]'.format(s=a)
   #+END_SRC

   #+RESULTS:
   : outer before function a = [xie]
   : inter x = [xie] before modify
   : inter x = [xieend] after modify
   : outer after function a = [xie]

* python实用命令
** 共享文件目录
  直接进到目录这样：
  #+BEGIN_SRC sh :results outputs :tangle /tmp/test_from_org_tangle.sh :exports code
    # Python 2
    python -m SimpleHTTPServer

    # Python 3
    python -m http.server
  #+END_SRC
** 脚本性能分析 
   #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
     python -m cProfile main.py
   #+END_SRC
   备注：cProfile是一个比profile更快的实现，因为它是用c写的

** CSV转换为json
   #+BEGIN_SRC sh :results outputs :tangle /tmp/test_from_org_tangle.sh :exports both
     python -c "import csv,json;print json.dumps(list(csv.reader(open('csv_file.csv'))))"
   #+END_SRC

** 列表辗平
   #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
     import itertools

     a_list = [[1, 2], [3, 4], [5, 6]]
     print list(itertools.chain.from_iterable(a_list))
   #+END_SRC

   #+RESULTS:
   : [1, 2, 3, 4, 5, 6]

