archive/before-2018-11-10/2017-07-05-python进阶笔记.html

<div id="outline-container-org467a740" class="outline-3">
<h3 id="org467a740"><span class="section-number-3">10.1</span> 总结可变类型和不可变类型</h3>
<div class="outline-text-3" id="text-10-1">
<p>
不可变类型：
</p>
<ol class="org-ol">
<li>元组 <code>(1, 2)</code> 。</li>
<li><p>
string ：可以发现s和d都是指向的同一块内存。但是使用切片后，c其实
是copy出来。
</p>
<div class="org-src-container">
<pre class="src src-python">        <span style="color: #ff8700;">s</span> = <span style="color: #ff4ea3;">'xiepeng'</span>
        <span style="color: #ff8700;">d</span> = <span style="color: #ff4ea3;">'xiepeng'</span>
        <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">id</span>(s)
        <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">id</span>(d)

        <span style="color: #ff8700;">c</span> = d[1:]
        <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">id</span>(s)
        <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">id</span>(d)
        <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">id</span>(c)
</pre>
</div></li>
<li><p>
int和float。77在内存中是同一块地址，但是 <code>j+1</code> ，其实也是执行了
copy的动作。
</p>
<div class="org-src-container">
<pre class="src src-python">        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">int_test</span>(): 
            <span style="color: #ff8700;">i</span> = 77
            <span style="color: #ff8700;">j</span> = 77
            <span style="color: #a1db00;">print</span>(<span style="color: #d18aff;">id</span>(77))                    <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">140396579590760</span>
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">'i id:'</span> + <span style="color: #d18aff;">str</span>(<span style="color: #d18aff;">id</span>(i)))      <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">i id:140396579590760</span>
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">'j id:'</span> + <span style="color: #d18aff;">str</span>(<span style="color: #d18aff;">id</span>(j)))      <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">j id:140396579590760</span>
            <span style="color: #a1db00;">print</span> i <span style="color: #a1db00;">is</span> j                     <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">True</span>
            <span style="color: #ff8700;">j</span> = j + 1
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">'new i id:'</span> + <span style="color: #d18aff;">str</span>(<span style="color: #d18aff;">id</span>(i)))  <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">new i id:140396579590760</span>
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">'new j id:'</span> + <span style="color: #d18aff;">str</span>(<span style="color: #d18aff;">id</span>(j)))  <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">new j id:140396579590736</span>
            <span style="color: #a1db00;">print</span> i <span style="color: #a1db00;">is</span> j                     <span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">False</span>

        <span style="color: #a1db00;">if</span> <span style="color: #d18aff;">__name__</span> == <span style="color: #ff4ea3;">'__main__'</span>:
            int_test()
</pre>
</div></li>
</ol>

<p>
可变类型：
</p>
<ol class="org-ol">
<li><p>
dict和list。因为是可变的，所以这里没有拷贝。都是在一块内存里搞事
情。
</p>
<div class="org-src-container">
<pre class="src src-python">        <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">dict_test</span>():
            <span style="color: #ff8700;">a</span> = {}
            <span style="color: #ff8700;">b</span> = a
            <span style="color: #a1db00;">print</span>(<span style="color: #d18aff;">id</span>(a))
            <span style="color: #ff8700;">a</span>[<span style="color: #ff4ea3;">'a'</span>] = <span style="color: #ff4ea3;">'hhhh'</span>
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">'id a:'</span> + <span style="color: #d18aff;">str</span>(<span style="color: #d18aff;">id</span>(a)))
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">'a:'</span> + <span style="color: #d18aff;">str</span>(a))
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">'id b:'</span> + <span style="color: #d18aff;">str</span>(<span style="color: #d18aff;">id</span>(b)))
            <span style="color: #a1db00;">print</span>(<span style="color: #ff4ea3;">'b:'</span> + <span style="color: #d18aff;">str</span>(b))

        <span style="color: #a1db00;">if</span> <span style="color: #d18aff;">__name__</span> == <span style="color: #ff4ea3;">'__main__'</span>:
            dict_test()
</pre>
</div></li>
</ol>

<p>
python函数调用的时候都是传递的引用，也就是传给函数原变量实际指向的
内存空间。如果传递的是可变参数类型，在函数内部对该参数的修改会体现
到原变量上。这样会出问题的。应避免。
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">fun</span>(x):
         <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'inter x = %s before modify'</span> % x
         x.append(5)
         <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'inter x = %s after modify'</span> % x
    

     <span style="color: #ff8700;">a</span> = [1,2,3]
     <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'outer before function a = %s'</span> % a
     fun(a)
     <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'outer after function a = %s'</span> % a
</pre>
</div>

<p>
换成不可变类型的string表现就正常了。
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">fun</span>(x):
         <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'inter x = [{s}] before modify'</span>.<span style="color: #d18aff;">format</span>(s=x)
         <span style="color: #ff8700;">x</span> = x + <span style="color: #ff4ea3;">'end'</span>
         <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'inter x = [{s}] after modify'</span>.<span style="color: #d18aff;">format</span>(s=x)


     <span style="color: #ff8700;">a</span> = <span style="color: #ff4ea3;">'xie'</span>
     <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'outer before function a = [{s}]'</span>.<span style="color: #d18aff;">format</span>(s=a)
     fun(a)
     <span style="color: #a1db00;">print</span> <span style="color: #ff4ea3;">'outer after function a = [{s}]'</span>.<span style="color: #d18aff;">format</span>(s=a)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org830a0ec" class="outline-2">
<h2 id="org830a0ec"><span class="section-number-2">11</span> python实用命令</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgce7ad6d" class="outline-3">
<h3 id="orgce7ad6d"><span class="section-number-3">11.1</span> 共享文件目录</h3>
<div class="outline-text-3" id="text-11-1">
<p>
直接进到目录这样：
</p>
<div class="org-src-container">
<pre class="src src-sh">    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Python 2</span>
    python -m SimpleHTTPServer

    <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">Python 3</span>
    python -m http.server
</pre>
</div>
</div>
</div>
<div id="outline-container-org3428189" class="outline-3">
<h3 id="org3428189"><span class="section-number-3">11.2</span> 脚本性能分析</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-python">     python -m cProfile main.py
</pre>
</div>

<p>
备注：cProfile是一个比profile更快的实现，因为它是用c写的
</p>
</div>
</div>

<div id="outline-container-org6195267" class="outline-3">
<h3 id="org6195267"><span class="section-number-3">11.3</span> CSV转换为json</h3>
<div class="outline-text-3" id="text-11-3">
<div class="org-src-container">
<pre class="src src-sh">     python -c <span style="color: #ff4ea3;">"import csv,json;print json.dumps(list(csv.reader(open('csv_file.csv'))))"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4d59bfa" class="outline-3">
<h3 id="org4d59bfa"><span class="section-number-3">11.4</span> 列表辗平</h3>
<div class="outline-text-3" id="text-11-4">
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">import</span> itertools

     <span style="color: #ff8700;">a_list</span> = [[1, 2], [3, 4], [5, 6]]
     <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">list</span>(itertools.chain.from_iterable(a_list))
</pre>
</div>
</div>
</div>
