wiki/python进阶笔记.org
** 一行式的构造器
   避免类初始化时大量重复的赋值语句:
   #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
     # -*- coding: utf-8; -*-
     class A(object):
         def __init__(self, a, b, c, d, e, f):
             self.__dict__.update({k: v for k, v in locals().items() if k != 'self'})


     # 上面语句可以工作请看下面：
     class C(object):
         """Documentation for C

         """
         def __init__(self, a, b, c=4):
             print locals()
             print self.__dict__
             self.__dict__.update({'z': 15})
             print self.__dict__
             print self.z

     c = C(2, 3)
   #+END_SRC

   #+RESULTS:
   : {'a': 2, 'c': 4, 'b': 3, 'self': <__main__.C object at 0x100766490>}
   : {}
   : {'z': 15}
   : 15

** 命令行下编译py文件
   #+BEGIN_SRC sh :results outputs :tangle /tmp/test_from_org_tangle.sh :exports code :mkdirp yes
     python -m py_compile file.py file2.py
   #+END_SRC


* 对象自省
  自省(introspection)，在计算机编程领域里，是指在运行时来判断一个对象
  的类型的能力。它是Python的强项之一。Python中所有一切都是一个对象，而
  且我们可以仔细勘察那些对象。

** dir
   它返回一个列表，列出了一个对象的所有属性和方法。
   #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
     a = 2
     print dir(a)
   #+END_SRC

   #+RESULTS:
   : ['__abs__', '__add__', '__and__', '__class__', '__cmp__', '__coerce__', '__delattr__', '__div__', '__divmod__', '__doc__', '__float__', '__floordiv__', '__format__', '__getattribute__', '__getnewargs__', '__hash__', '__hex__', '__index__', '__init__', '__int__', '__invert__', '__long__', '__lshift__', '__mod__', '__mul__', '__neg__', '__new__', '__nonzero__', '__oct__', '__or__', '__pos__', '__pow__', '__radd__', '__rand__', '__rdiv__', '__rdivmod__', '__reduce__', '__reduce_ex__', '__repr__', '__rfloordiv__', '__rlshift__', '__rmod__', '__rmul__', '__ror__', '__rpow__', '__rrshift__', '__rshift__', '__rsub__', '__rtruediv__', '__rxor__', '__setattr__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__truediv__', '__trunc__', '__xor__', 'bit_length', 'conjugate', 'denominator', 'imag', 'numerator', 'real']

   如果不传入参数，它可以返回当前作用域的所有名字：
   #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
     a = 2
     b = a
     print dir()
   #+END_SRC

   #+RESULTS:
   : ['__builtins__', '__doc__', '__file__', '__name__', '__package__', 'a', 'b']

** type和id
   #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
     print(type(1))
     print(type('xiepeng'))

     print(id(7))
     print(id(7))
   #+END_SRC

   #+RESULTS:
   : <type 'int'>
   : <type 'str'>
   : 4298162808

** inspect
   #+BEGIN_SRC python :results output :exports both :tangle /tmp/test_from_org_tangle.py
     import inspect
     print(inspect.getmembers(str))
     print(dir(str))
   #+END_SRC

   #+RESULTS:
   : [('__add__', <slot wrapper '__add__' of 'str' objects>), ('__class__', <type 'type'>), ('__contains__', <slot wrapper '__contains__' of 'str' objects>), ('__delattr__', <slot wrapper '__delattr__' of 'object' objects>), ('__doc__', "str(object='') -> string\n\nReturn a nice string representation of the object.\nIf the argument is a string, the return value is the same object."), ('__eq__', <slot wrapper '__eq__' of 'str' objects>), ('__format__', <method '__format__' of 'str' objects>), ('__ge__', <slot wrapper '__ge__' of 'str' objects>), ('__getattribute__', <slot wrapper '__getattribute__' of 'str' objects>), ('__getitem__', <slot wrapper '__getitem__' of 'str' objects>), ('__getnewargs__', <method '__getnewargs__' of 'str' objects>), ('__getslice__', <slot wrapper '__getslice__' of 'str' objects>), ('__gt__', <slot wrapper '__gt__' of 'str' objects>), ('__hash__', <slot wrapper '__hash__' of 'str' objects>), ('__init__', <slot wrapper '__init__' of 'object' objects>), ('__le__', <slot wrapper '__le__' of 'str' objects>), ('__len__', <slot wrapper '__len__' of 'str' objects>), ('__lt__', <slot wrapper '__lt__' of 'str' objects>), ('__mod__', <slot wrapper '__mod__' of 'str' objects>), ('__mul__', <slot wrapper '__mul__' of 'str' objects>), ('__ne__', <slot wrapper '__ne__' of 'str' objects>), ('__new__', <built-in method __new__ of type object at 0x100187540>), ('__reduce__', <method '__reduce__' of 'object' objects>), ('__reduce_ex__', <method '__reduce_ex__' of 'object' objects>), ('__repr__', <slot wrapper '__repr__' of 'str' objects>), ('__rmod__', <slot wrapper '__rmod__' of 'str' objects>), ('__rmul__', <slot wrapper '__rmul__' of 'str' objects>), ('__setattr__', <slot wrapper '__setattr__' of 'object' objects>), ('__sizeof__', <method '__sizeof__' of 'str' objects>), ('__str__', <slot wrapper '__str__' of 'str' objects>), ('__subclasshook__', <built-in method __subclasshook__ of type object at 0x100187540>), ('_formatter_field_name_split', <method '_formatter_field_name_split' of 'str' objects>), ('_formatter_parser', <method '_formatter_parser' of 'str' objects>), ('capitalize', <method 'capitalize' of 'str' objects>), ('center', <method 'center' of 'str' objects>), ('count', <method 'count' of 'str' objects>), ('decode', <method 'decode' of 'str' objects>), ('encode', <method 'encode' of 'str' objects>), ('endswith', <method 'endswith' of 'str' objects>), ('expandtabs', <method 'expandtabs' of 'str' objects>), ('find', <method 'find' of 'str' objects>), ('format', <method 'format' of 'str' objects>), ('index', <method 'index' of 'str' objects>), ('isalnum', <method 'isalnum' of 'str' objects>), ('isalpha', <method 'isalpha' of 'str' objects>), ('isdigit', <method 'isdigit' of 'str' objects>), ('islower', <method 'islower' of 'str' objects>), ('isspace', <method 'isspace' of 'str' objects>), ('istitle', <method 'istitle' of 'str' objects>), ('isupper', <method 'isupper' of 'str' objects>), ('join', <method 'join' of 'str' objects>), ('ljust', <method 'ljust' of 'str' objects>), ('lower', <method 'lower' of 'str' objects>), ('lstrip', <method 'lstrip' of 'str' objects>), ('partition', <method 'partition' of 'str' objects>), ('replace', <method 'replace' of 'str' objects>), ('rfind', <method 'rfind' of 'str' objects>), ('rindex', <method 'rindex' of 'str' objects>), ('rjust', <method 'rjust' of 'str' objects>), ('rpartition', <method 'rpartition' of 'str' objects>), ('rsplit', <method 'rsplit' of 'str' objects>), ('rstrip', <method 'rstrip' of 'str' objects>), ('split', <method 'split' of 'str' objects>), ('splitlines', <method 'splitlines' of 'str' objects>), ('startswith', <method 'startswith' of 'str' objects>), ('strip', <method 'strip' of 'str' objects>), ('swapcase', <method 'swapcase' of 'str' objects>), ('title', <method 'title' of 'str' objects>), ('translate', <method 'translate' of 'str' objects>), ('upper', <method 'upper' of 'str' objects>), ('zfill', <method 'zfill' of 'str' objects>)]
   : ['__add__', '__class__', '__contains__', '__delattr__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__getitem__', '__getnewargs__', '__getslice__', '__gt__', '__hash__', '__init__', '__le__', '__len__', '__lt__', '__mod__', '__mul__', '__ne__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__rmod__', '__rmul__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '_formatter_field_name_split', '_formatter_parser', 'capitalize', 'center', 'count', 'decode', 'encode', 'endswith', 'expandtabs', 'find', 'format', 'index', 'isalnum', 'isalpha', 'isdigit', 'islower', 'isspace', 'istitle', 'isupper', 'join', 'ljust', 'lower', 'lstrip', 'partition', 'replace', 'rfind', 'rindex', 'rjust', 'rpartition', 'rsplit', 'rstrip', 'split', 'splitlines', 'startswith', 'strip', 'swapcase', 'title', 'translate', 'upper', 'zfill']

  它和 =dir= 的区别是dir只返回 =name= ，而它返回 =(name, attribute)=
  这样的元组。
