archive/before-2018-11-10/2017-07-05-python进阶笔记.html

<div id="outline-container-org29e1df6" class="outline-3">
<h3 id="org29e1df6"><span class="section-number-3">11.5</span> 一行式的构造器</h3>
<div class="outline-text-3" id="text-11-5">
<p>
避免类初始化时大量重复的赋值语句:
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">-*- coding: utf-8; -*-</span>
     <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">A</span>(<span style="color: #d18aff;">object</span>):
         <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__init__</span>(<span style="color: #a1db00;">self</span>, a, b, c, d, e, f):
             <span style="color: #a1db00;">self</span>.__dict__.update({k: v <span style="color: #a1db00;">for</span> k, v <span style="color: #a1db00;">in</span> <span style="color: #d18aff;">locals</span>().items() <span style="color: #a1db00;">if</span> k != <span style="color: #ff4ea3;">'self'</span>})


     <span style="color: #6c6c6c; font-style: italic;"># </span><span style="color: #6c6c6c; font-style: italic;">&#19978;&#38754;&#35821;&#21477;&#21487;&#20197;&#24037;&#20316;&#35831;&#30475;&#19979;&#38754;&#65306;</span>
     <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">C</span>(<span style="color: #d18aff;">object</span>):
         <span style="color: #ff4b4b;">"""Documentation for C</span>

<span style="color: #ff4b4b;">         """</span>
         <span style="color: #a1db00;">def</span> <span style="color: #ffd700;">__init__</span>(<span style="color: #a1db00;">self</span>, a, b, c=4):
             <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">locals</span>()
             <span style="color: #a1db00;">print</span> <span style="color: #a1db00;">self</span>.__dict__
             <span style="color: #a1db00;">self</span>.__dict__.update({<span style="color: #ff4ea3;">'z'</span>: 15})
             <span style="color: #a1db00;">print</span> <span style="color: #a1db00;">self</span>.__dict__
             <span style="color: #a1db00;">print</span> <span style="color: #a1db00;">self</span>.z

     <span style="color: #ff8700;">c</span> = C(2, 3)
</pre>
</div>
</div>
</div>

<div id="outline-container-org30ffa2c" class="outline-3">
<h3 id="org30ffa2c"><span class="section-number-3">11.6</span> 命令行下编译py文件</h3>
<div class="outline-text-3" id="text-11-6">
<div class="org-src-container">
<pre class="src src-sh">     python -m py_compile file.py file2.py
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgaf685ea" class="outline-2">
<h2 id="orgaf685ea"><span class="section-number-2">12</span> 对象自省</h2>
<div class="outline-text-2" id="text-12">
<p>
自省(introspection)，在计算机编程领域里，是指在运行时来判断一个对象
的类型的能力。它是Python的强项之一。Python中所有一切都是一个对象，而
且我们可以仔细勘察那些对象。
</p>
</div>

<div id="outline-container-org0a344a3" class="outline-3">
<h3 id="org0a344a3"><span class="section-number-3">12.1</span> dir</h3>
<div class="outline-text-3" id="text-12-1">
<p>
它返回一个列表，列出了一个对象的所有属性和方法。
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #ff8700;">a</span> = 2
     <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">dir</span>(a)
</pre>
</div>

<p>
如果不传入参数，它可以返回当前作用域的所有名字：
</p>
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #ff8700;">a</span> = 2
     <span style="color: #ff8700;">b</span> = a
     <span style="color: #a1db00;">print</span> <span style="color: #d18aff;">dir</span>()
</pre>
</div>
</div>
</div>

<div id="outline-container-orge8a7d0e" class="outline-3">
<h3 id="orge8a7d0e"><span class="section-number-3">12.2</span> type和id</h3>
<div class="outline-text-3" id="text-12-2">
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">print</span>(<span style="color: #d18aff;">type</span>(1))
     <span style="color: #a1db00;">print</span>(<span style="color: #d18aff;">type</span>(<span style="color: #ff4ea3;">'xiepeng'</span>))

     <span style="color: #a1db00;">print</span>(<span style="color: #d18aff;">id</span>(7))
     <span style="color: #a1db00;">print</span>(<span style="color: #d18aff;">id</span>(7))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee5d645" class="outline-3">
<h3 id="orgee5d645"><span class="section-number-3">12.3</span> inspect</h3>
<div class="outline-text-3" id="text-12-3">
<div class="org-src-container">
<pre class="src src-python">     <span style="color: #a1db00;">import</span> inspect
     <span style="color: #a1db00;">print</span>(inspect.getmembers(<span style="color: #d18aff;">str</span>))
     <span style="color: #a1db00;">print</span>(<span style="color: #d18aff;">dir</span>(<span style="color: #d18aff;">str</span>))
</pre>
</div>

<p>
它和 <code>dir</code> 的区别是dir只返回 <code>name</code> ，而它返回 <code>(name, attribute)</code>
这样的元组。
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>